<a href="https://colab.research.google.com/github/madhavimali/SQL_SQLZoo_HackerRank_Practice_Questions_with_Solutions/blob/main/SQL_Practice.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Query the list of CITY names from STATION that either do not start with vowels or do not end with vowels. Your result cannot contain duplicates.

In [ ]:
select distinct city
from station
where city not regexp '^[aeiou]'
or   city not regexp '[aeiou]$'

In [ ]:
select distinct city from station 
where (city not like '%a' and city not like '%e' and city not like '%i' and city not like '%o' and city not like '%u') or
 (city not like 'a%' and city not like 'e%' and city not like 'i%' and city not like 'o%' and city not like 'u%')

Query the list of CITY names from STATION that do not end with vowels. Your result cannot contain duplicates.

In [ ]:
select distinct city from station 
where city not like '%a' and city not like '%e' and city not like '%i' and city not like '%o' and city not like '%u'

Query the list of CITY names from STATION that do not start with vowels. Your result cannot contain duplicates.

In [ ]:
select distinct city from station 
where city not like 'a%' and city not like 'e%' and city not like 'i%' and city not like 'o%' and city not like 'u%'

Query the list of CITY names from STATION which have vowels (i.e., a, e, i, o, and u) as both their first and last characters. Your result cannot contain duplicates.

In [ ]:
select distinct city from station 
where (city like 'a%' or city like 'e%' or city like 'i%' or city like 'o%' or city like 'u%') and (city like '%a' or city like '%e' or city like '%i' or city like '%o' or city like '%u')

SyntaxError: ignored

Query the list of CITY names ending with vowels (a, e, i, o, u) from STATION. Your result cannot contain duplicates.

Input Format

The STATION table is described as follows:

In [ ]:
select distinct city from station 
where city like '%a' or city like '%e' or city like '%i' or city like '%o' or city like '%u'

Query the list of CITY names starting with vowels (i.e., a, e, i, o, or u) from STATION. Your result cannot contain duplicates.

Input Format

In [ ]:
select distinct city from station 
where city like 'a%' or city like 'e%' or city like 'i%' or city like 'o%' or city like 'u%'

Q. 15 List all the people who have worked with 'Art Garfunkel'.

In [ ]:
select actor.name 
from actor join casting on casting.actorid = actor.id         
           join movie on casting.movieid = movie.id 
           
where movie.title in 
(select title 
from movie join casting on casting.movieid = movie.id 
           join actor on casting.actorid = actor.id
where actor.name =  'Art Garfunkel')
and actor.name != 'Art Garfunkel'
order by actor.name

#Self Join

How many stops are in the database.

In [ ]:
select count(id) from stops

Find the id value for the stop 'Craiglockhart'

In [ ]:
select * from route

Give the id and the name for the stops on the '4' 'LRT' service.

In [ ]:
select stops.id, stops.name from stops 
join route on stops.id = route.stop
where company = 'LRT' and num = '4'

The query shown gives the number of routes that visit either London Road (149) or Craiglockhart (53). Run the query and notice the two services that link these stops have a count of 2. Add a HAVING clause to restrict the output to these two routes.

In [ ]:
SELECT company, num, count(stop)
FROM stops join route on stops.id = route.stop
 WHERE stop=149 OR stop=53
GROUP BY company, num
having count(stop) >= 2

Execute the self join shown and observe that b.stop gives all the places you can get to from Craiglockhart, without changing routes. Change the query so that it shows the services from Craiglockhart to London Road.

In [ ]:
SELECT a.company, a.num, a.stop, b.stop
FROM route a JOIN route b ON
  (a.company=b.company AND a.num=b.num)
WHERE a.stop= (select id from stops where name = 
               'Craiglockhart')
 and b.stop = (select id from stops where name = 'London Road')

The query shown is similar to the previous one, however by joining two copies of the stops table we can refer to stops by name rather than by number. Change the query so that the services between 'Craiglockhart' and 'London Road' are shown. If you are tired of these places try 'Fairmilehead' against 'Tollcross'

In [ ]:
SELECT a.company, a.num, stopa.name, stopb.name
FROM route a JOIN route b ON
  (a.company=b.company AND a.num=b.num)
  JOIN stops stopa ON (a.stop=stopa.id)
  JOIN stops stopb ON (b.stop=stopb.id)
WHERE 
(stopa.name='Craiglockhart' and stopb.name = 'London Road')
or
(stopb.name= 'Fairmilehead' and stopb.name=  'Tollcross')